API/core/app/Models/Model_strukturPKK.php

SELECT *
FROM `tbl_struktur_pkk`
JOIN `tbl_warga` ON `tbl_warga`.`nomorIndukKependudukan` = `tbl_struktur_pkk`.`nik`
---
    public function getStrukturPKK()
    {
    	$db      = \Config\Database::connect();
		$builder = $db->table('tbl_struktur_pkk');
		$builder->select('*');
		$builder->join('tbl_warga', 'tbl_warga.nomorIndukKependudukan = tbl_struktur_pkk.nik');
		return $builder->get()->getResultArray();