API/core/app/Models/Model_user.php

SELECT *
FROM `tbl_user`
---
    public function getUser()
    {
        return $this->findAll();