API/core/app/Models/Model_data.php

SELECT *
FROM `tb_catatan_keluarga`
JOIN `tbl_warga` ON `tbl_warga`.`nomorIndukKependudukan` = `tb_catatan_keluarga`.`nik`
JOIN `tb_kriteria_rumah` ON `tb_kriteria_rumah`.`id` = `tb_catatan_keluarga`.`kriteria_rumah`
JOIN `tb_sumber_air_keluarga` ON `tb_sumber_air_keluarga`.`id` = `tb_catatan_keluarga`.`sumber_air`
JOIN `tb_tempat_sampah` ON `tb_tempat_sampah`.`id` = `tb_catatan_keluarga`.`tempat_sampah`
JOIN `tb_kegiatan_pkk_yg_diikuti` ON `tb_kegiatan_pkk_yg_diikuti`.`id` = `tb_catatan_keluarga`.`jenis_kegiatan_id`
JOIN `tb_makanan_pokok` ON `tb_makanan_pokok`.`id` = `tb_catatan_keluarga`.`makanan_pokok`
---
    public function getCatatanKeluargaAll()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tb_catatan_keluarga');
        $builder->select('*');
        $builder->join('tbl_warga', 'tbl_warga.nomorIndukKependudukan = tb_catatan_keluarga.nik');
        $builder->join('tb_kriteria_rumah', 'tb_kriteria_rumah.id = tb_catatan_keluarga.kriteria_rumah');
        $builder->join('tb_sumber_air_keluarga', 'tb_sumber_air_keluarga.id = tb_catatan_keluarga.sumber_air');
        $builder->join('tb_tempat_sampah', 'tb_tempat_sampah.id = tb_catatan_keluarga.tempat_sampah');
        $builder->join('tb_kegiatan_pkk_yg_diikuti', 'tb_kegiatan_pkk_yg_diikuti.id = tb_catatan_keluarga.jenis_kegiatan_id');
        $builder->join('tb_makanan_pokok', 'tb_makanan_pokok.id = tb_catatan_keluarga.makanan_pokok');
        return $builder->get()->getResultArray();

SELECT *
FROM `tb_catatan_status_ibu`
JOIN `tbl_warga` ON `tbl_warga`.`nomorIndukKependudukan` = `tb_catatan_status_ibu`.`nik_ibu`
JOIN `tb_catatan_kematian` ON `tb_catatan_kematian`.`catatan_status_ibu_id` = `tb_catatan_status_ibu`.`id`
---
    public function getStatusIbuBayiMeninggal()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tb_catatan_status_ibu');
        $builder->select('*');
        $builder->join('tbl_warga', 'tbl_warga.nomorIndukKependudukan = tb_catatan_status_ibu.nik_ibu');
        $builder->join('tb_catatan_kematian', 'tb_catatan_kematian.catatan_status_ibu_id = tb_catatan_status_ibu.id');
        return $builder->get()->getResultArray();

SELECT *
FROM `tb_catatan_status_ibu`
JOIN `tbl_warga` ON `tbl_warga`.`nomorIndukKependudukan` = `tb_catatan_status_ibu`.`nik_ibu`
JOIN `tb_catatan_kelahiran` ON `tb_catatan_kelahiran`.`catatan_status_ibu_id` = `tb_catatan_status_ibu`.`id`
---
    public function getStatusIbuBayiLahir()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tb_catatan_status_ibu');
        $builder->select('*');
        $builder->join('tbl_warga', 'tbl_warga.nomorIndukKependudukan = tb_catatan_status_ibu.nik_ibu');
        $builder->join('tb_catatan_kelahiran', 'tb_catatan_kelahiran.catatan_status_ibu_id = tb_catatan_status_ibu.id');
        return $builder->get()->getResultArray();

SELECT *
FROM `tbl_Warga`
WHERE `nomorIndukKependudukan` = '1234567890'
---
    public function getAnggotaDasawisma()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_user_dasawisma');
        $builder->select('*');
        $builder->join('tbl_warga', 'tbl_warga.nomorIndukKependudukan = tbl_user_dasawisma.nik');
        $builder->join('tb_dasa_wisma', 'tb_dasa_wisma.id = tbl_user_dasawisma.idDasawisma');
        return $builder->get()->getResultArray();

SELECT *
FROM `tbl_struktur_pkk`
JOIN `tbl_warga` ON `tbl_warga`.`nomorIndukKependudukan` = `tbl_struktur_pkk`.`nik`
WHERE `nik` = '1515151515'
---
    public function getStrukturPKKDetail($id=null)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_struktur_pkk');
        $builder->select('*');
        $builder->where('nik',$id);
        $builder->join('tbl_warga', 'tbl_warga.nomorIndukKependudukan = tbl_struktur_pkk.nik');
        return $builder->get()->getResultArray();