API/core/app/Models/Model_makananPokok.php

    public function getMakananPokok()
    {
        return $this->findAll();
---
SELECT *
FROM `tb_makanan_pokok`