API/core/app/Controllers/APIWarga.php

    public function show($id = null)
    {
        $model = new Model_warga();
        $data = $model->where('nomorIndukKependudukan',$id)->findAll();
---
SELECT *
FROM `tbl_warga`
WHERE `nomorIndukKependudukan` = '1515151515'