API/core/app/Controllers/CatatanStatusIbu.php

INSERT INTO `tb_catatan_status_ibu` (`kode_kecamatan`, `kode_desa`, `kode_dasa_wisma`, `tgl`, `nik_ibu`, `nama_ibu`, `nama_suami`, `status`) VALUES ('494', '494', '494', '2023-02-01 00:00:00.000', '1234567890', 'M DICO TRIYADI', 'Testing', 'lahir')
---
                'nama_suami'        => $namaSuami,
                'status'            => $status,
            ];
            $catatanStatusIbu->insert($data);

DELETE FROM `tb_catatan_status_ibu`
WHERE `id` IN ('25')
---
                $dataStatusIbu = $catatanStatusIbu->where($filterStatus)->orderBy('id','DESC')->findAll();
                $cekDataLahir = $catatanKelahiran->where('akte',$akte)->findAll();
                if($cekDataLahir != null){
                    $catatanStatusIbu->delete($dataStatusIbu[0]['id']);

INSERT INTO `tb_catatan_kelahiran` (`catatan_status_ibu_id`, `catatan_status_ibu`, `nama_bayi`, `jenis_kelamin`, `tgl_lahir`, `akte`) VALUES ('7', 'Lahir', 'tess', 'Perempuan', '494', '1234')
---
                    'tgl_lahir'             => $tglLahir,
                    'akte'                  => $akte,
                ];
                $catatanKelahiran->insert($dataLahir);