API/core/app/Controllers/DaftarPermohonan.php

    public function create()
    {
        //variable
        $surat              = new Model_surat();
        $pemerintahDesa     = new Model_struktur_pemerintah_desa();
        $warga              = new Model_warga();
        $nik                = $this->request->getVar('nik');
        $token              = $this->request->getVar('token');
        // Validasi Token
        $cekPemerintahDesa = $pemerintahDesa->where('nik',$nik)->findAll();
---
SELECT *
FROM `tbl_struktur_pemerintah_desa`
WHERE `nik` = '1234567890000000'