API/core/app/Controllers/Dasawisma.php

                'RW' => $RW,
                'nama_desa_wisma' => $namaDasaWisma,
            ];
            $dasawisma->insert($data);
---
INSERT INTO `tb_dasa_wisma` (`kode_kecamatan`, `kode_desa`, `kode_dusun`, `RT`, `RW`) VALUES ('123123123', '123123123', '-', '-', '-')