API/core/app/Controllers/LoginAdmin.php

    public function create()
    {
        //variable
        $warga  = new Model_warga();
        $admin  = new Model_user();
        $nik    = $this->request->getVar('nik');
        $pass   = $this->request->getVar('password');
        // proses Data
        $cekWarga = $warga->where('nomorIndukKependudukan',$nik)->findAll();
        if($cekWarga != null){
            $cekAdmin = $admin->where('username',$nik)->findAll();
---
SELECT *
FROM `tbl_warga`
WHERE `nomorIndukKependudukan` = '123123123'
SELECT *
FROM `tbl_user`
WHERE `username` = '123123123'