API/core/app/Controllers/LoginWarga.php

    public function create()
    {
        //variable
        $warga              = new Model_warga();
        $user               = new Model_user();
        $pkk                = new Model_strukturPKK();
        $anggotaDasawisma   = new Model_AnggotaDasawisma();
        $pemerintahDesa     = new Model_struktur_pemerintah_desa();
        $data               = new Model_data();
        $nik                = $this->request->getVar('nik');
        $pass               = $this->request->getVar('password');
        // proses Data
        // Cek Warga
        $cekWarga = $warga->where('nomorIndukKependudukan',$nik)->findAll();
        if($cekWarga != null){
            // Cek Admin
            $cekAdmin               = $user->where('username',$nik)->findAll();
            $cekPKK                 = $pkk->where('nik',$nik)->findAll();
            $cekPemerintahDesa      = $pemerintahDesa->where('nik',$nik)->findAll();
---
SELECT *
FROM `tbl_warga`
WHERE `nomorIndukKependudukan` = '1234567890'
SELECT *
FROM `tbl_user`
WHERE `username` = '1234567890'
SELECT *
FROM `tbl_struktur_pkk`
WHERE `nik` = '1234567890'
SELECT *
FROM `tbl_struktur_pemerintah_desa`
WHERE `nik` = '1234567890'

                    $updateToken = [
                        'token' => $token
                    ];
                    $warga->update($cekWarga[0]['idWarga'],$updateToken);
---
UPDATE `tbl_warga` SET `token` = 963
WHERE `tbl_warga`.`idWarga` IN ('63')

                    $updateToken = [
                        'token' => $token
                    ];
                    $warga->update($cekWarga[0]['idWarga'],$updateToken);
---
UPDATE `tbl_warga` SET `token` = 333
WHERE `tbl_warga`.`idWarga` IN ('57')