API/core/app/Controllers/LoginDasaWisma.php

SELECT *
FROM `tbl_warga`
WHERE `nomorIndukKependudukan` = '123123123'
SELECT *
FROM `tbl_struktur_pkk`
WHERE `nik` = '123123123'
UPDATE `tbl_warga` SET `token` = 440
WHERE `tbl_warga`.`idWarga` IN ('61')
---
    public function create()
    {
        //variable
        $warga  = new Model_warga();
        $pkk    = new Model_strukturPKK();
        $nik    = $this->request->getVar('nik');
        $pass   = $this->request->getVar('password');
        $cekWarga = $warga->where('nomorIndukKependudukan',$nik)->findAll();
        //Cek User dan Cek Warga
        if($cekWarga != null){
            $cekWargaPassword   = password_verify($pass,$cekWarga[0]['password']);
            if($cekWargaPassword == true){
                $cekPKK = $pkk->where('nik',$nik)->findAll();
                if($cekPKK != null){
                    $token = rand(10,1000);
                    $updateToken = [
                        'token' => $token
                    ];
                    $warga->update($cekWarga[0]['idWarga'],$updateToken);
                    $dataUpdate = $warga->where('nomorIndukKependudukan',$nik)->findAll();