API/core/app/Controllers/PemasukkanKeuangan.php

    public function create()
    {
        //variable
        $warga                      = new Model_warga();
        $PemasukkanKeuangan         = new Model_pemasukkanKeuangan();
        $nik                        = $this->request->getVar('nik');
        $token                      = $this->request->getVar('token');
        $kodeKecamatan              = $this->request->getVar('kodeKecamatan');
        $kodeDesa                   = $this->request->getVar('kodeDesa');
        $kodeDasaWisma              = $this->request->getVar('kodeDasaWisma');
        $sumberDanaPemasukkan       = $this->request->getVar('sumberDanaPemasukkan');
        $uraianPemasukkan           = $this->request->getVar('uraianPemasukkan');
        $nomorBuktiKasPemasukkan    = $this->request->getVar('nomorBuktiKasPemasukkan');
        $jumlahPemasukkan           = $this->request->getVar('jumlahPemasukkan');
        $tgl                        = $this->request->getVar('tgl');
        // Validasi Token
        $dataValidasi = [
            'nomorIndukKependudukan' => $nik,
            'token' => $token
        ];
        $cekTokenWarga  = $warga->where($dataValidasi)->findAll();
        if($cekTokenWarga == null){
            $response = [
                'status'    => 400,
                'messages'  => "Tidak bisa diakses !!, silahkan login terlebih dahulu"
            ];
            return $this->respond($response);
        }else{
            // Proses Data
            $cekNomorBukti = $PemasukkanKeuangan->where('nomor_bukti_kas_pemasukkan',$nomorBuktiKasPemasukkan)->findAll();
---
SELECT *
FROM `tb_pemasukkan_keuangan`
WHERE `nomor_bukti_kas_pemasukkan` = '49114'