API/core/app/Controllers/TambahAnggotaDasawisma.php

    public function create()
    {
        //variable
        $warga                      = new Model_warga();
        $anggotaDasawisma           = new Model_AnggotaDasawisma();
        $pkk                        = new Model_strukturPKK();
        $nik                        = $this->request->getVar('nik');
        $token                      = $this->request->getVar('token');
        $valueNikAnggota            = $this->request->getVar('nikAnggota');
        $valueIdDasaWisma           = $this->request->getVar('idDasawisma');
        $valueJabatanAnggota        = $this->request->getVar('jabatanAnggota');
        // Validasi Token
        $dataValidasi = [
            'nomorIndukKependudukan' => $nik,
            'token' => $token
        ];
        $cekTokenWarga  = $warga->where($dataValidasi)->findAll();
        if($cekTokenWarga == null){
            $response = [
                'status'    => 400,
                'messages'  => "Tidak bisa diakses !!, silahkan login terlebih dahulu"
            ];
            return $this->respond($response,400);
        }else{
            // Proses Data
            $cekHakAksesKetua       = $anggotaDasawisma->where('nik',$nik)->findAll();
            $cekHakAksesAnggotaPKK  = $pkk->where('nik',$nik)->findAll();
---
SELECT *
FROM `tbl_struktur_pkk`
WHERE `nik` = '1010101010101010'